# Задание:
# Создать игру крестики-нолики.
# Консоль, куда будет выводиться ход игры. С помощью форматированных строк.
# ------------------------------------------------------------------------
# ------------------------------------------------------------------------

# >>>>>>> Элемент - "Поле Игры" >>>>>>>
# Список(матрица) 3x3. Main board = m.
# Пока оформляю в виде списка-списков. Пустые поля (незаполненные игроками) по умолчанию заполнены текстом "-".
m = [
     ['-', '-', '-'],
     ['-', '-', '-'],
     ['-', '-', '-']
]